package programmers.naverFinancial.programming4;

/*
N x N 정사각형 격자에서 다음과 같은 룰을 가진 게임을 합니다.

최 좌측 상단(0, 0)에서 출발해서 최 우측 하단(N - 1, N - 1)에 도착하여야 합니다.

1-1. (a, b) = (행 번호, 열 번호)입니다.

인접한 칸들 중에서, 오른쪽 혹은 아래쪽 칸으로만 이동할 수 있습니다.

격자의 바깥으로는 벗어날 수 없습니다.

방문한 칸에 적힌 숫자만큼 점수를 획득합니다.

0 이 적힌 칸을 방문하면, 현재까지 획득한 점수에 -1을 곱할 수 있습니다. 즉, 부호를 바꿀 수 있습니다.

5-1. 부호를 바꾸지 않고, 그대로 유지하여도 괜찮습니다.

(N-1, N-1)에 도착했을 때, 획득한 점수를 가능한 크게 하는 것이 게임의 목적입니다.

아래 그림은 5 x 5 크기의 격자에서 최대 점수를 획득하는 경로를 나타냅니다.
 */

public class Programming4 {
    public static void main(String[] args) {

    }
}
